{
    "version": "https://jsonfeed.org/version/1",
    "title": "Techpression",
    "description": "",
    "home_page_url": "https://enhasa666.github.io",
    "feed_url": "https://enhasa666.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Enhasa"
    },
    "items": [
        {
            "id": "https://enhasa666.github.io/how-to-start-a-blog.html",
            "url": "https://enhasa666.github.io/how-to-start-a-blog.html",
            "title": "How to Start A Blog",
            "summary": "Starting a blog is one of the most popular avenues for creative expression today. It is relatively easy to do, free on most cases even if you don't know where to look, and virtually friction-free when getting your content out to the hands of your&hellip;",
            "content_html": "<p>Starting a blog is one of the most popular avenues for creative expression today. It is relatively easy to do, free on most cases even if you don't know where to look, and virtually friction-free when getting your content out to the hands of your readers.</p>\n<p>I will say this right off the bat: self-publishing and promotion is easy, but that doesn't mean you're going to get readers into your blog. In fact, you probably won't.</p>\n<p>Unless you're dedicated to writing good-vibes bullshit for years on end, or are spamming other bloggers' comments section in hopes that they comment back on your blog, you're literally just a tiny speck of sand in the desert that is the internet that everyone will ignore.</p>\n<p>But don't let this faze you! If you want to do something - like start a blog - fucking do it. Don't let the fact that your efforts will probably go unnoticed stop you from doing something different with your life. And think about it: if you vent your anger off somewhere else on the far reaches of the internet, you'll save yourself from the social suicide you will <span style=\"text-decoration: line-through;\">probably most likely</span> surely commit on Facebook or Twitter.</p>\n<p>Ready to pull the hopefully-metaphorical trigger?</p>\n<h2 id=\"mcetoc_1dg98e8fb0\">Easy steps to start a blog</h2>\n<p><strong>Step one is the hardest for most people</strong> - it was for me.</p>\n<p>Before you start doing anything, you're going to have to accept that you're not a special cookie. Your unorthodox opinions do not make you unique, as you probably have them just because they're wildly different from those of your peers.</p>\n<p>Even if your world views were actually as cool as you think they were, then why aren't you talking about it on TED Talks or some shit? What credentials do you have that we must listen to you as you assert some radical crap that no one will (or no one will want to) listen to? </p>\n<p>Consider this: global warming is an undeniable phenomena confirmed by thousands of brilliant scientists around the world, and even they are brushed off by the general population. These group of brilliant scientists have years of experience and research behind them - not to mention they are <em>genuinely intelligent</em> - yet we cover our ears as we're fed the 10000th warning that humanity will fall under its own weight if we don't do something about it.</p>\n<p>We continue to purchase gargantuan SUVs - a purchase justified by the coming of a couple's first baby, of course - and ignore warnings of humanity's impending doom. What makes you think \"your audience\" is going to do any different and actually listen to you?</p>\n<p><em>The first step to start a blog, then, is to accept that no one will bother reading your work</em>. Just write as you would like to write and enjoy the process. </p>\n<p>No matter well you write it, or how dedicated you are to editing it to make sure you're writing effectively, nobody will appreciate it. No matter how sound an argument you make, you're not changing anyone's minds. </p>\n<p>Who cares? Why does it matter anyway? You're going to be nobody forever and there's nothing you can do to change that.</p>\n<p>Just do it.</p>\n<p><strong>With step two, things begin to get a lot easier</strong>.</p>\n<p>Get yourself a good blogging platform. I would recommend something like <a href=\"https://wordpress.com\" target=\"_blank\" rel=\"noopener noreferrer\">WordPress</a> or <a href=\"https://www.blogger.com\" target=\"_blank\" rel=\"noopener noreferrer\">Blogger</a>, as they are the two most popular services out there. They're so reliable that I could even imagine their servers continuing to run even amidst a global cataclysm that I think couldn't come any sooner.</p>\n<p>Note: I would recommend something like <a href=\"https://www.wix.com\">Wix </a>or similar graphical website builders, but I personally have no experience with them and they seem like they have more features than the regular blogger would need. </p>\n<p><strong>Step three: create an account and start posting.</strong></p>\n<p>That's it! You can now start writing content that will most definintely not be read by anyone ever! Well, maybe your chosen platform's content moderators will, but they will forget about it seconds after as they move through their thousands-long moderation queue, after which you have passed you will become nothing more but a mere statistic.</p>\n<p>Have fun!</p>",
            "author": {
                "name": "Enhasa"
            },
            "tags": [
            ],
            "date_published": "2019-07-21T11:05:01+08:00",
            "date_modified": "2019-07-21T11:56:14+08:00"
        }
    ]
}
